<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"local","plan_modifier":"051a6df03c1b94ddb53b9a5329a560edecfe2c5bcd6a6a36ac0b75d175265fcb","backend":"fd6534973737f32a503f75c888f49bb6c620b9e1c0602f7db3fa96db16b9f6df","plan_job_ref":"Job Test plan target and replace #345 at https://github.com/dflook/terraform-github-actions/actions/runs/5389587937","plan_hash":"988b4e6d2a91a697437d0797d5aa1db34bdbaaa69fc0230ff3694d564adbfa4c","plan_text_format":"text","version":"99.0.0"} -->
Terraform plan in __tests/workflows/test-target-replace__
Replacing resources: `random_string.foreach["hello"]`, `random_string.count[0]`
With variables: `length = 10`
<details>
<summary>Plan: 2 to add, 0 to change, 2 to destroy. Changes to Outputs.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # random_string.count[0] will be replaced, as requested
-/+ resource "random_string" "count" {
      ~ id          = "**********" -> (known after apply)
      ~ result      = "**********" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # random_string.foreach["hello"] will be replaced, as requested
-/+ resource "random_string" "foreach" {
      ~ id          = "**********" -> (known after apply)
      ~ result      = "**********" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

Plan: 2 to add, 0 to change, 2 to destroy.

Changes to Outputs:
  ~ count   = "IVzlPZxhRK" -> (known after apply)
  ~ foreach = "yHXEZHzDCw" -> (known after apply)
```
</details>

:memo: Plan generated in [Test plan target and replace #345](https://github.com/dflook/terraform-github-actions/actions/runs/5389587937)